["```py\npip install pandas.\n```", "```py\nWeb3.fromWei(latestData), 'ether')\n```", "```py\nFormula: Mean = (Sum of all values) / (Total number of values)\n```", "```py\ndf['price'].mean()\n```", "```py\ndf['price'].median()\n```", "```py\nFormula: No specific formula\n```", "```py\ndf['price'].mode()[0]\n```", "```py\nChapter06/Outliers).\n\n*   `df.quantile()` function. Once we have them, we can calculate other parts of this formula.\n\n    In `Chapter05/Outliers`, we calculate the IQR, bottom, and upper limits in this part of the code:\n\n![Figure 6.13 – Calculation of IQR and limits](img/B19446_06_13.jpg)\n\nFigure 6.13 – Calculation of IQR and limits\nThe 1.5 multiplier is common practice but can be adjusted to adapt to our case.\n\n*   **Three-sigma rule** (**Z-score**): The three-sigma rule states that 99.7% of data falls within three standard deviations (three-sigma) of the mean in a normal distribution. This rule is used for outlier detection because data points outside the three sigmas can be considered outliers.\n\n    This method uses the mean as a starting point, which can be influenced by outliers. A more robust modified Z-score method can be employed, which incorporates the median and median absolute deviation in its formula. The metric is a statistical measure that helps identify outliers in a dataset by comparing each data point to the median and median absolute deviation. It provides a robust way to detect extreme values, especially in datasets with skewed distributions.\n\nSummary\nThis chapter has addressed various preparation methods applicable to on-chain data scenarios. We explored techniques such as unhexing data, decimal treatment, handling checksum addresses, and converting Unix timestamps to datetime formats. These methods have proven foundational in preparing the on-chain data for subsequent analysis.\nMoreover, we introduced the concept of EDA as a crucial step in understanding and summarizing datasets, with a specific focus on central tendency metrics. Additionally, we delved into outlier detection techniques, such as box plots and the IQR method, aiding in the identification of extreme observations deviating significantly from the majority of the data.\nBy applying these cleaning and EDA techniques, we have equipped ourselves with essential tools for the effective analysis and interpretation of on-chain data. These foundational concepts serve as building blocks for more advanced techniques and methodologies as we continue this journey. For more insights into these methodologies, please refer to the *Further* *reading* section.\nFurther reading\nThe following links may help to complement this chapter:\n\n*   Technical requirements:\n    *   *10 minutes to pandas, pandas 1.5.3 documentation, pandas - Python Data Analysis* *Library:* https://pandas.pydata.org/docs/user_guide/10min.xhtml#min\n*   Evolution of smart contracts:\n    *   *Upgrading Smart Contracts,* *ethereum.org:* [https://ethereum.org/en/developers/docs/smart-contracts/upgrading/](https://ethereum.org/en/developers/docs/smart-contracts/upgrading/)\n*   Exploratory Data Analysis:\n    *   *Introduction to Data Science: A Python Approach to Concepts, Techniques and Applications,* Laura Igual, Santi Seguí, Springer\n    *   *Three Ways to Detect Outliers, Colin Gorrie, Colin Gorrie’s Data* *Story:* [https://colingorrie.github.io/outlier-detection.xhtml#modified-z-score-method](https://colingorrie.github.io/outlier-detection.xhtml#modified-z-score-method)\n    *   *Python for Data Analysis: Data Wrangling With Pandas, NumPy, and Jupyter,* Wes McKinney, O’Reilly Media\n    *   *Box Plot Review, Khan* *Academy:* [https://www.khanacademy.org/math/statistics-probability/summarizing-quantitative-data/box-whisker-plots/a/box-plot-review](https://www.khanacademy.org/math/statistics-probability/summarizing-quantitative-data/box-whisker-plots/a/box-plot-review)\n    *   *Hands-On Exploratory Data Analysis With Python: Perform EDA Techniques to Understand, Summarize, and Investigate Your Data,* Usman Ahmed, Suresh Kumar Mukhiya, O’Reilly Media*:* [https://www.packtpub.com/product/hands-on-exploratory-data-analysis-with-python/9781789537253](https://www.packtpub.com/product/hands-on-exploratory-data-analysis-with-python/9781789537253)\n    *   *The Data Science Design Manual,* Steven Skiena, Springer\n*   Cleaning:\n    *   *RSK* *Explorer*: [https://explorer.rsk.co/blocks](https://explorer.rsk.co/blocks)\n    *   *More on Time on the Blockchain, Nick Furneaux, Wiley*, [*Chapter 9*](B19446_09.xhtml#_idTextAnchor269), Investigating Cryptocurrencies, Understanding, Extracting, and Analyzing Blockchain Evidence, Page 156 to Page 161\n\n```"]